<a href="https://colab.research.google.com/github/kdChen07/progress-and-problems/blob/main/%E5%8F%AF%E9%80%89POI%E4%B8%8E%E6%97%A0%E7%96%AB%E8%8B%97%E6%9C%8D%E5%8A%A1MSOA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#计算可以选择的潜在POI与无服务的MSAO

In [ ]:
!pip install access
!pip install logging
!pip install geopandas
!pip install mapclassify
!pip install legendgram

In [ ]:
from access import access, weights, datasets
import logging
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import mapclassify as mc
from legendgram import legendgram
import palettable.matplotlib as palmpl
import seaborn as sns
import numpy as np
from scipy import stats
from google.colab import files
from shapely import wkt

#导入数据

In [7]:
MSOA=pd.read_csv('https://github.com/kdChen07/progress-and-problems/blob/main/data/Boundary%20MSOAs%20Lack%20of%20Vaccination%20Service.csv?raw=ture')
MSOA.head(1)

   Unnamed: 0   MSOA11CD  ... MSOA_with_supply  dissolve
0           1  E02002527  ...            False         1

[1 rows x 14 columns]

In [8]:
MSOA['geometry'] = MSOA['geometry'].apply(wkt.loads)
MSOA_bou = gpd.GeoDataFrame(MSOA, geometry='geometry')
MSOA_bou.crs = 'epsg:27700'

In [9]:
MSOA_bou

     Unnamed: 0   MSOA11CD  ... MSOA_with_supply  dissolve
0             1  E02002527  ...            False         1
1             2  E02002692  ...            False         1
2             3  E02002693  ...            False         1
3             4  E02002694  ...            False         1
4             5  E02002695  ...            False         1
..          ...        ...  ...              ...       ...
378         379  E02006845  ...            False         1
379         380  E02006846  ...            False         1
380         381  E02006857  ...            False         1
381         382  E02006870  ...            False         1
382         383  E02006880  ...            False         1

[383 rows x 14 columns]

In [10]:
MSOA_point=pd.read_csv('https://github.com/kdChen07/progress-and-problems/blob/main/data/Point%20MSOAs%20Lack%20of%20Vaccination%20Service.csv?raw=ture')
MSOA_point.head(1)

   index  objectid  ...   MSOA MSOA_with_supply
0      1       311  ...  False            False

[1 rows x 6 columns]

In [11]:
MSOA_point['geometry'] = MSOA_point['geometry'].apply(wkt.loads)
MSOA_lack = gpd.GeoDataFrame(MSOA_point, geometry='geometry')
MSOA_lack.crs = 'epsg:27700'
#MSOA_lack.crs = 'epsg:4326'

In [12]:
MSOA_lack = MSOA_lack.to_crs('epsg:4326')
MSOA_lack['point_lon'] = MSOA_lack['geometry'].x
MSOA_lack['point_lat'] = MSOA_lack['geometry'].y

In [13]:
MSOA_lack

     index  objectid   msoa11cd  ... MSOA_with_supply  point_lon  point_lat
0        1       311  E02002527  ...            False  -0.895104  54.556813
1        2      1636  E02002692  ...            False  -0.900405  53.979796
2        3      1634  E02002693  ...            False  -0.271017  53.945190
3        4      1632  E02002694  ...            False  -0.778200  53.931540
4        5      1631  E02002695  ...            False  -0.168981  53.909875
..     ...       ...        ...  ...              ...        ...        ...
378    379      6413  E02006845  ...            False  -2.906422  51.358374
379    380      6410  E02006846  ...            False  -2.929576  51.347977
380    381      5000  E02006857  ...            False   0.313122  50.786367
381    382      1484  E02006870  ...            False  -0.786744  54.132341
382    383      5705  E02006880  ...            False   1.167870  51.078965

[383 rows x 8 columns]

In [ ]:
#MSOA_lack_df

     index  objectid   msoa11cd  point_lon  point_lat
0        1       311  E02002527  -0.895104  54.556813
1        2      1636  E02002692  -0.900405  53.979796
2        3      1634  E02002693  -0.271017  53.945190
3        4      1632  E02002694  -0.778200  53.931540
4        5      1631  E02002695  -0.168981  53.909875
..     ...       ...        ...        ...        ...
378    379      6413  E02006845  -2.906422  51.358374
379    380      6410  E02006846  -2.929576  51.347977
380    381      5000  E02006857   0.313122  50.786367
381    382      1484  E02006870  -0.786744  54.132341
382    383      5705  E02006880   1.167870  51.078965

[383 rows x 5 columns]

In [15]:
df=pd.read_csv('https://github.com/kdChen07/progress-and-problems/blob/main/data/poi_three_types1.csv?raw=ture')
df.head(1)

   index          name  feature_easting  feature_northing  pointx_class
0      1  Reiver House         338714.0          556014.0       5280365

In [16]:
point = gpd.GeoDataFrame(df, geometry=gpd.points_from_xy(df.feature_easting, df.feature_northing))
point.crs = 'epsg:27700'

In [17]:
point = point.to_crs('epsg:4326')
point['point_lon'] = point['geometry'].x
point['point_lat'] = point['geometry'].y

In [18]:
point

       index                      name  ...  point_lon  point_lat
0          1              Reiver House  ...  -2.957088  54.895084
1          2           Lloyds Pharmacy  ...  -1.556017  52.413332
2          3           Wilson Hospital  ...  -0.163246  51.397288
3          4           Elland Pharmacy  ...  -1.836388  53.686351
4          5          Pimhole Pharmacy  ...  -2.282894  53.593018
...      ...                       ...  ...        ...        ...
21807  21808                 Ultralase  ...  -3.178908  51.481971
21808  21809     Fadeaway Laser Clinic  ...  -1.374558  50.897631
21809  21810               Midland Eye  ...  -1.775749  52.419652
21810  21811  Optimax Laser Eye Clinic  ...  -0.081829  51.516296
21811  21812  Optimax Laser Eye Clinic  ...  -1.548501  53.799366

[21812 rows x 8 columns]

In [19]:
point_df = point[['index','name','point_lon','point_lat']]
point_df

       index                      name  point_lon  point_lat
0          1              Reiver House  -2.957088  54.895084
1          2           Lloyds Pharmacy  -1.556017  52.413332
2          3           Wilson Hospital  -0.163246  51.397288
3          4           Elland Pharmacy  -1.836388  53.686351
4          5          Pimhole Pharmacy  -2.282894  53.593018
...      ...                       ...        ...        ...
21807  21808                 Ultralase  -3.178908  51.481971
21808  21809     Fadeaway Laser Clinic  -1.374558  50.897631
21809  21810               Midland Eye  -1.775749  52.419652
21810  21811  Optimax Laser Eye Clinic  -0.081829  51.516296
21811  21812  Optimax Laser Eye Clinic  -1.548501  53.799366

[21812 rows x 4 columns]

In [22]:
distance_cost_df = pd.read_csv('https://github.com/kdChen07/progress-and-problems/blob/main/data/distance18994.csv?raw=ture') 
distance_cost_df = distance_cost_df.rename(columns={"Distance in meter": "cost", "origin_id": "origin", "destination_id": "dest","Unnamed: 0":"index"})
distance_cost_df

       index     cost     origin   dest
0          0  17438.2  E02002527    124
1          1  15669.6  E02002527   4155
2          2    608.3  E02002527   4159
3          3  16577.0  E02002527   4162
4          4  11904.9  E02002527   4609
...      ...      ...        ...    ...
18989  18989   4303.6  E02006880  18563
18990  18990   1405.0  E02006880  18686
18991  18991  19443.3  E02006880  18900
18992  18992   6235.8  E02006880  19549
18993  18993   7014.5  E02006880  19886

[18994 rows x 4 columns]

#筛选距离小于10英里的距离

In [23]:
distance_cost_df_test = distance_cost_df.loc[distance_cost_df['cost']<16093.44]
distance_cost_df_test

       index     cost     origin   dest
1          1  15669.6  E02002527   4155
2          2    608.3  E02002527   4159
4          4  11904.9  E02002527   4609
5          5  14355.9  E02002527   5050
7          7    989.8  E02002527   5056
...      ...      ...        ...    ...
18986  18986   6549.4  E02006880  17608
18989  18989   4303.6  E02006880  18563
18990  18990   1405.0  E02006880  18686
18992  18992   6235.8  E02006880  19549
18993  18993   7014.5  E02006880  19886

[8816 rows x 4 columns]

In [24]:
a = pd.unique(distance_cost_df_test['origin'])

# Set 'MSOA_with_supply' field True if a place has at least one vaccination site within 10 miles of distance, otherwise False.
b = pd.DataFrame()
b['MSOA'] = a
b['MSOA_with_supply'] = True

MSOA_with_supply = pd.merge(left = MSOA_point,right = b, how='left', left_on='msoa11cd', right_on='MSOA')
MSOA_with_supply=MSOA_with_supply.fillna(False)

In [25]:
MSOA_with_supply

     index  objectid  ...     MSOA_y MSOA_with_supply_y
0        1       311  ...  E02002527               True
1        2      1636  ...  E02002692               True
2        3      1634  ...  E02002693               True
3        4      1632  ...  E02002694               True
4        5      1631  ...  E02002695               True
..     ...       ...  ...        ...                ...
378    379      6413  ...  E02006845               True
379    380      6410  ...  E02006846               True
380    381      5000  ...  E02006857               True
381    382      1484  ...  E02006870               True
382    383      5705  ...  E02006880               True

[383 rows x 8 columns]

In [26]:
distance_cost_df_test

       index     cost     origin   dest
1          1  15669.6  E02002527   4155
2          2    608.3  E02002527   4159
4          4  11904.9  E02002527   4609
5          5  14355.9  E02002527   5050
7          7    989.8  E02002527   5056
...      ...      ...        ...    ...
18986  18986   6549.4  E02006880  17608
18989  18989   4303.6  E02006880  18563
18990  18990   1405.0  E02006880  18686
18992  18992   6235.8  E02006880  19549
18993  18993   7014.5  E02006880  19886

[8816 rows x 4 columns]

In [27]:
point_df

       index                      name  point_lon  point_lat
0          1              Reiver House  -2.957088  54.895084
1          2           Lloyds Pharmacy  -1.556017  52.413332
2          3           Wilson Hospital  -0.163246  51.397288
3          4           Elland Pharmacy  -1.836388  53.686351
4          5          Pimhole Pharmacy  -2.282894  53.593018
...      ...                       ...        ...        ...
21807  21808                 Ultralase  -3.178908  51.481971
21808  21809     Fadeaway Laser Clinic  -1.374558  50.897631
21809  21810               Midland Eye  -1.775749  52.419652
21810  21811  Optimax Laser Eye Clinic  -0.081829  51.516296
21811  21812  Optimax Laser Eye Clinic  -1.548501  53.799366

[21812 rows x 4 columns]

In [28]:
c = pd.unique(distance_cost_df_test['dest'])
d = pd.DataFrame()
d['point'] = c
d['opt_points'] = True

opt_points = pd.merge(left = point_df,right = d,how='left',left_on='index',right_on='point')
opt_points = opt_points.fillna(False)

In [29]:
opt_points

       index                      name  point_lon  point_lat  point  opt_points
0          1              Reiver House  -2.957088  54.895084  False       False
1          2           Lloyds Pharmacy  -1.556017  52.413332  False       False
2          3           Wilson Hospital  -0.163246  51.397288  False       False
3          4           Elland Pharmacy  -1.836388  53.686351  False       False
4          5          Pimhole Pharmacy  -2.282894  53.593018  False       False
...      ...                       ...        ...        ...    ...         ...
21807  21808                 Ultralase  -3.178908  51.481971  False       False
21808  21809     Fadeaway Laser Clinic  -1.374558  50.897631  False       False
21809  21810               Midland Eye  -1.775749  52.419652  False       False
21810  21811  Optimax Laser Eye Clinic  -0.081829  51.516296  False       False
21811  21812  Optimax Laser Eye Clinic  -1.548501  53.799366  False       False

[21812 rows x 6 columns]

In [30]:
opt_points.to_csv('opt_points.csv')

In [31]:
files.download('opt_points.csv')